//---------------------------------------------------------------------------
//
// "華和梨" for あれ以外の何か以外の何か
// 暗号化/復号化
//
//      Programed by NAKAUE.T (Meister)
//
//  2001.03.15  Phase 0.42    暗号化実装
//  2001.03.19  Phase 7.9.0   新暗号!KAWA0001形式
//
//---------------------------------------------------------------------------
#ifndef KAWARI_CRYPT_H
#define KAWARI_CRYPT_H
//---------------------------------------------------------------------------
#include "config.h"
//---------------------------------------------------------------------------
#include <string>
using namespace std;
//---------------------------------------------------------------------------
// 暗号化形式を確認する
extern bool CheckCrypt(const string& encodedstr);
//---------------------------------------------------------------------------
// 標準暗号化
extern string EncryptString(const string& str);
//---------------------------------------------------------------------------
// 新暗号化(暗号キー付)
extern string EncryptString2(const string& str,const string &key);
//---------------------------------------------------------------------------
// 標準復号化
extern string DecryptString(const string& encodedstr);
//---------------------------------------------------------------------------
// 新暗号化(暗号キー付)
extern string DecryptString2(const string& encodedstr,const string &key);
//---------------------------------------------------------------------------
#endif
